## Maths Operations in Pandas

In [20]:
import pandas as pd

In [21]:
df_exams = pd.read_csv("datasets/StudentsPerformance.csv")
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

### **Operations in Columns**

In [22]:
# Calculate total sum of a column
df_exams['math score'].sum()

np.int64(66089)

In [23]:
# Calculate count, mean, standard deviation, max and min
df_exams['math score'].count(), df_exams['math score'].mean(), df_exams['math score'].std(), df_exams['math score'].max(), df_exams['math score'].min()

(np.int64(1000), np.float64(66.089), 15.163080096009468, 100, 0)

In [24]:
# Calculate all stats of a column with .describe()
df_exams['math score'].describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math score, dtype: float64

In [25]:
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

### **Operations in Rows**

In [29]:
# Calculating the sum in a row

# Example: sum of math score + reading score + writing score for each row.
df_exams['math score'] + df_exams['reading score'] + df_exams['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [31]:
# Calculating average score

exam_average = (df_exams['math score'] + df_exams['reading score'] + df_exams['writing score']) / 3

In [36]:
# Add average rounded score to DataFrame and show DataFrame

df_exams['average'] = exam_average.round(2)
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.00
996,male,group C,high school,free/reduced,none,62,55,55,57.33
997,female,group C,high school,free/reduced,completed,59,71,65,65.00
998,female,group D,some college,standard,completed,68,78,77,74.33
999,female,group D,some college,free/reduced,none,77,86,86,83.00